src/Performance-Test/image-processing/temp-becnhmark.txt
This is ApacheBench, Version 2.3 <$Revision: 1604373 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking cse19-iiith.vlabs.ac.in (be patient)


Server Software:        Apache/2.2.22
Server Hostname:        cse19-iiith.vlabs.ac.in
Server Port:            80

Document Path:          /
Document Length:        13372 bytes

Concurrency Level:      190
Time taken for tests:   1.803 seconds
Complete requests:      1500
Failed requests:        0
Total transferred:      20502000 bytes
HTML transferred:       20058000 bytes
Requests per second:    832.08 [#/sec] (mean)
Time per request:       228.344 [ms] (mean)
Time per request:       1.202 [ms] (mean, across all concurrent requests)
Transfer rate:          11106.31 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        2   12  44.7     11    1010
Processing:     7  199 254.1    163    1790
Waiting:        5  198 254.1    162    1789
Total:          9  211 257.9    174    1800

Percentage of the requests served within a certain time (ms)
  50%    174
  66%    174
  75%    175
  80%    175
  90%    175
  95%    176
  98%   1762
  99%   1783
 100%   1800 (longest request)